[[AJACS1]]へ戻る

&size(18){AJACS1講習会【ゲノム情報リテラシー入門】};<br>
&size(14){かずさDNA研究所 中村保一};

        --
&size(24){http://motdb.dbcls.jp/ から講習資料ページを開いてください};

[[TinyURL:http://tinyurl.com/]] によるこのページの簡略化URL: <br>
&size(24){http://tinyurl.com/3crhby};
        --

大規模に決定されつつあるおおくの生物種のゲノム塩基配列は、多様化膨大化がすすむ生物情報の基盤となるべき分子情報であることは言うまでもない。近年の計算機とインターネットの進歩はめざましく（いや、すさまじく）今や膨大なゲノム情報と言えども「そこらのパソコン」と「ご家庭の回線」で取り扱うことができる時代となった。つまり、大型計算機の取り扱いを専門としない実験屋さんでも、あるいはアマチュアの安楽椅子研究者でさえも、その情報を活用し、専門家がとりこぼした、あるいは思いもよらない新たな知識を導き出すことさえできる準備が整っているのだ。

しかし、配列情報を活用するためには、ある程度の技術的な基礎知識が必要となる。そこで、この講習では、フリーのツールやデータベースを使い倒し、ゲノム情報を活用するために最低限知っておくべきことを、講義と実習の両面から紹介していこうと思う。

この講習を通じて（かずさDNA研究所のような）ゲノム情報を生産しているサイトが行っている情報処理の概要を知ってもらい、さらにはゲノム情報データベース高度化のためのアノテーション、キュレーション、あるいはDB整備を職業とする、という選択肢があることにあなたの興味をもってもらうことができれば幸いである。なぜなら、データベースの統合という大きな事業を推進するためには、優秀な人材にわれわれのプロジェクトに参加して腕を振るってもらうことが、欠かせないことなのだからだ。

いろいろな網羅研究が展開されているなかで、ゲノム研究ひとつに限っても、シーケンサからの生の測定データを、データベースとして「使える」カタチにして公開するまでには、さまざまな情報処理の手順が必要となる。いきおい紹介する内容はつまみ食い的になってしまうが、より網羅的に学びたくなった場合のため、以下のエッセンシャルな参考書を紹介しておく。

また、書籍だけでなく、ライフサイエンスの統合DBプロジェクトによって、統合TV、ポータル、横断検索などの、一般ユーザの使いやすさを徹底的に指向した、よりよいリファレンスやツールが整備されつつある。それらも是非、あわせて活用し、ゲノム情報を使い倒せる人になってほしい。

もちろん、欲しい情報やツールがない場合には、あなた自身によるフィードバックや寄与が可能であり、そうした姿勢は、研究者としてきわめて大事であることを忘れないでほしい。


参考書
+「改訂第2版 バイオデータベースとウェブツールの手とり足とり活用法」<br>
http://www.amazon.co.jp/dp/4758108110
+「バイオインフォマティクス基礎講義　一歩進んだ発想をみがくために」<br>
http://www.amazon.co.jp/dp/4895923436/
+「バイオインフォマティクス：ゲノム配列から機能解析へ 第２版」<br>
http://www.amazon.co.jp/dp/4895924262/


        --

#日程 (13:30 - 17:30; 適宜休憩を入れます) [#l111a7f2]

- 13:30 - 14:30 60分　[[part 1:>./part1]] 自己紹介 【実習】まずは肩慣らし「検索使い倒し」
- 14:30 - 15:30 60分　[[part 2:>./part2]] ゲノム塩基配列と類似検索 【実習】配列情報へのアクセス、BLASTあれこれ
- 15:30 - 16:30 60分　[[part 3:>./part3]] 塩基配列の注釈入門と遺伝子構造予測 【実習】遺伝子発見ツール・スプライスサイト予測・Martでデータ取得
- 16:30 - 17:30 60分　[[part 4:>./part4]] 遺伝子機能予測とDB高度化 【実習】Interpro・GO・[[CyanoGenes:http://bacteria.kazusa.or.jp/cyanobase/Synechocystis/comments/]]・[[KazusaAnnotation:http://a.kazusa.or.jp]]

        --

#目次 [#w265ef5f]

#ls2(,title,compact)

//----
//*参考書籍、サイト等 [#x914eff6]
//-[[ReferenceBooks]]
//-[[なぜ、今MacOS Xをすすめるのか>MacOSXintroduction]]

#counter

        --
[[AJACS1]]へ戻る
